k6/after/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)

WARN[0000] error getting terminal size                   error="The handle is invalid."

running (10.2s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s

     ✓ find path

     checks.........................: 100.00% ✓ 10       ✗ 0
     data_received..................: 970 B   95 B/s
     data_sent......................: 1.5 kB  144 B/s
     http_req_blocked...............: avg=1.39ms   min=0s     med=0s     max=13.99ms p(90)=1.39ms   p(95)=7.69ms
     http_req_connecting............: avg=399.92µs min=0s     med=0s     max=3.99ms  p(90)=399.91µs p(95)=2.19ms
   ✓ http_req_duration..............: avg=8.74ms   min=6.62ms med=7.01ms max=22ms    p(90)=10.3ms   p(95)=16.15ms
       { expected_response:true }...: avg=8.74ms   min=6.62ms med=7.01ms max=22ms    p(90)=10.3ms   p(95)=16.15ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 10
     http_req_receiving.............: avg=102.93µs min=0s     med=0s     max=1.02ms  p(90)=102.92µs p(95)=566.11µs
     http_req_sending...............: avg=0s       min=0s     med=0s     max=0s      p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s      p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=8.63ms   min=6.62ms med=7ms    max=22ms    p(90)=10.3ms   p(95)=16.15ms
     http_reqs......................: 10      0.983722/s
     iteration_duration.............: avg=1.01s    min=1s     med=1.01s  max=1.04s   p(90)=1.02s    p(95)=1.03s
     iterations.....................: 10      0.983722/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1